# Задача 1
# L=int(input('левая граница '))
# R=int(input('правая граница '))
# left_list=[x**3 for x in range(L,R+1) ]
# print(left_list)
# Right_list=[x**2 for x in range(L,R+1) ]
# print(Right_list)

# задача 2
# stroka=input('введите строку ')
# sym=input('введите символ ')
#
# list_1=[x+x for x in stroka]
# print(list_1)
# list_1=[x+x+sym for x in stroka]
# print(list_1)



