# import platform
# import sys
# info = 'OS info is \n{}\n\nPython version is {} {}'.format(
#     platform.uname(),
#     sys.version,
#     platform.architecture(),
# )
#
# print(info)
# with open('os_info.txt', 'w', encoding='utf8') as file:
#     file.write(info)


# Напишите две функции: первая принимает одно целое положительное число N и
# находит сумму всех чисел от 1 до N включительно; вторая принимает число N и считает
# количество цифр в числе. В ответе выводится разность суммы чисел и количества.
#
# Пример работы программы:
# Введите число: 500
#
# Сумма чисел: 5
# Кол-во цифр в числе: 3
# Разность суммы и кол-ва цифр: 2

# def count(N):
#     N = str(N)
#     for count in N:
#         a=1
#     return int(count)
#
# def sum(N,count):
#     for i in range(1,count+1):
#
#         print(num)
#
# N = 1234
# count=count(N)
# print('количество цифр в числе', count)
# sum(N,count)